app/controllers/comments_controller.rb

SELECT * FROM `comments` ORDER BY id DESC LIMIT 0, 30
SELECT count(*) AS count_all FROM `comments`
---
  def index
    @comments = Comment.paginate :page => params[:page], :order => 'id DESC'

SELECT * FROM `comments` WHERE (`comments`.`id` = 1)
---
  def show
    @comment = Comment.find(params[:id])

INSERT INTO `comments` (`name`, `updated_at`, `comment`, `email`, `created_at`) VALUES('Test', '2009-06-29 19:22:20', 'Test', 'test@grunzillas.com', '2009-06-29 19:22:20')
---
  def create
    @comment = Comment.new(params[:comment])

    render :update do |page|
      if @comment.save

SELECT * FROM `comments` WHERE (`comments`.`id` = 14)
DELETE FROM `comments` WHERE `id` = 14
---
  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy