app/controllers/games_controller.rb

SELECT * FROM `games`
SELECT sum(`games`.opponent_score) AS sum_opponent_score FROM `games`
---
  def index
    @games = Game.all

SELECT * FROM `games`
SELECT sum(`games`.opponent_score) AS sum_opponent_score FROM `games`
---
  def games
    @games = Game.all

SELECT * FROM `games` WHERE (`games`.`id` = 1)
---
  def show
    @game = Game.find(params[:id])

SELECT * FROM `games` WHERE (`games`.`id` = 1)
---
  def edit
    @game = Game.find(params[:id])

INSERT INTO `games` (`score`, `updated_at`, `date`, `opponent_score`, `created_at`) VALUES(4, '2009-06-25 19:16:13', '2009-06-09', 16, '2009-06-25 19:16:13')
---
  def create
    @game = Game.new(params[:game])

    respond_to do |format|
      if @game.save

SELECT * FROM `games` WHERE (`games`.`id` = 1)
UPDATE `games` SET `loss` = 1, `updated_at` = '2009-06-29 17:47:30' WHERE `id` = 1
---
  def update
    params[:game][:existing_statistic_attributes] ||= {}
    @game = Game.find(params[:id])

    respond_to do |format|
      if @game.update_attributes(params[:game])

SELECT * FROM `games` WHERE (`games`.`id` = 4)
DELETE FROM `games` WHERE `id` = 4
---
  def destroy
    @game = Game.find(params[:id])
    @game.destroy