app/controllers/schedules_controller.rb

  def show
    @schedule = Schedule.find(params[:id])
---
SELECT * FROM `schedules` WHERE (`schedules`.`id` = 1)

  def edit
    @schedule = Schedule.find(params[:id])
---
SELECT * FROM `schedules` WHERE (`schedules`.`id` = 1)

  def create
    @schedule = Schedule.new(params[:schedule])

    respond_to do |format|
      if @schedule.save
---
INSERT INTO `schedules` (`opponent`, `updated_at`, `time`, `date`, `field`, `created_at`) VALUES('Indians', '2009-06-30 14:20:02', '2009-06-09 17:15:00', '2009-06-09', 'G', '2009-06-30 14:20:02')

  def update
    @schedule = Schedule.find(params[:id])

    respond_to do |format|
      if @schedule.update_attributes(params[:schedule])
---
SELECT * FROM `schedules` WHERE (`schedules`.`id` = 1)
UPDATE `schedules` SET `datetime` = '2009-06-10 03:15:00', `updated_at` = '2009-06-30 14:26:03' WHERE `id` = 2