app/controllers/statistics_controller.rb

SELECT * FROM `statistics`
---
  def index
    @statistics = Statistic.all

SELECT * FROM `statistics` WHERE (last_name = 'statistic.last_name')
---
  def stats
    @stats_by_name = Statistic.find(:all, :conditions => ["last_name = ?", params[:last_name]], :order => "game_id")

SELECT * FROM `statistics` WHERE (`statistics`.`id` = 1)
---
  def show
    @statistic = Statistic.find(params[:id])