app/controllers/users_controller.rb

INSERT INTO `users` (`updated_at`, `crypted_password`, `username`, `password_salt`, `persistence_token`, `email`, `created_at`) VALUES('2009-06-30 17:22:20', 'c130385a3f294ab428f84bd6887511eec881f1617a923608187c15881f2524f82fb4f658c6ca028a701ac984a65c6d8b7811c8fb90a2a7fc312de80c04a7261d', 'johnny', 'CiOHaPbP_uFL7ZYP7_vs', '5751367ed34748f0ffa236a5f2eab1dee5808213139eaab4aff0f89c66e4ab40ed5e08d49d8b4b8b3f96b9fad97591f16f7d32d2732291ed69aefc5f39f671e5', 'johnnyn@gmail.com', '2009-06-30 17:22:20')
---
 def create
   @user = User.new(params[:user])
   if @user.save